#    1. Поработайте с переменными, создайте несколько, выведите на экран, запросите
#       у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.
Variable_1=213
Variable_2=5
print('1-я переменная',Variable_1, '2-я переменная',Variable_2)
number_1 = int (input('Напишите 1-ое число'))
number_2 = int (input('Напишите 2-ое число'))
inscription_1 = input('Напишите 1-ое слово')
inscription_2 = input('Напишите 2-ое слово')
print(f'Первое число: {number_1},Второе число: {number_2}, Первое слово: {inscription_1}, Второе слово:, {inscription_2}')